---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.MEPCurve
source: html/95a1e3bc-19a3-902c-7909-569221b46ffe.htm
---
# MEPCurve Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.